# Pandas

In [3]:
import pandas as pd

In [185]:
pd.set_option('display.max_rows', 1000)
pd.set_option('display.max_columns', 1000)

In [186]:
pd.get_option('display.date_dayfirst')

True

In [187]:
pd.get_option('display.date_yearfirst')

True

In [188]:
pd.set_option('display.date_dayfirst', True)

In [189]:
pd.set_option('display.date_yearfirst', True)

## Inlezen

In [131]:
sales = [{'account': 'Jones LLC', 'Jan': 150, 'Feb': 200, 'Mar': 140, 'dd':'7-2-2023'},
         {'account': 'Alpha Co',  'Jan': 200, 'Feb': 210, 'Mar': 215, 'dd':'8-2-2023'},
         {'account': 'Blue Inc',  'Jan': 50,  'Feb': 90,  'Apr': 95, 'dd':'9-2-2023' }]

df = pd.DataFrame(sales)

In [132]:
df

     account  Jan  Feb    Mar        dd   Apr
0  Jones LLC  150  200  140.0  7-2-2023   NaN
1   Alpha Co  200  210  215.0  8-2-2023   NaN
2   Blue Inc   50   90    NaN  9-2-2023  95.0

## Exploratie

In [118]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   account  3 non-null      object
 1   Jan      3 non-null      int64
 2   Feb      3 non-null      int64
 3   Mar      2 non-null      float64
 4   dd       3 non-null      object
 5   Apr      1 non-null      float64
dtypes: float64(2), int64(2), object(2)
memory usage: 272.0+ bytes

In [92]:
df.ndim

2

In [93]:
df.shape

(3, 5)

In [94]:
df.dtypes

account     object
Jan          int64
Feb          int64
Mar        float64
Apr        float64
dtype: object

In [95]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [96]:
list(df.columns)

['account', 'Jan', 'Feb', 'Mar', 'Apr']

In [97]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['account', 'Jan', 'Feb', 'Mar', 'Apr'], dtype='object')]

In [98]:
df.head(2)

     account  Jan  Feb    Mar  Apr
0  Jones LLC  150  200  140.0  NaN
1   Alpha Co  200  210  215.0  NaN

In [99]:
df.tail(2)

    account  Jan  Feb    Mar   Apr
1  Alpha Co  200  210  215.0   NaN
2  Blue Inc   50   90    NaN  95.0

In [100]:
df.count()

account    3
Jan        3
Feb        3
Mar        2
Apr        1
dtype: int64

In [101]:
df.describe()

              Jan         Feb         Mar   Apr
count    3.000000    3.000000    2.000000   1.0
mean   133.333333  166.666667  177.500000  95.0
std     76.376262   66.583281   53.033009   NaN
min     50.000000   90.000000  140.000000  95.0
25%    100.000000  145.000000  158.750000  95.0
50%    150.000000  200.000000  177.500000  95.0
75%    175.000000  205.000000  196.250000  95.0
max    200.000000  210.000000  215.000000  95.0

In [102]:
df['account'].value_counts()

Jones LLC    1
Alpha Co     1
Blue Inc     1
Name: account, dtype: int64

## Selecting columns

In [35]:
df

     account  Jan  Feb    Mar   Apr
0  Jones LLC  150  200  140.0   NaN
1   Alpha Co  200  210  215.0   NaN
2   Blue Inc   50   90    NaN  95.0

In [36]:
df['account']

0    Jones LLC
1     Alpha Co
2     Blue Inc
Name: account, dtype: object

In [37]:
df['Jan']

0    150
1    200
2     50
Name: Jan, dtype: int64

In [40]:
df[['Jan','Feb','Mar','Apr']]

   Jan  Feb    Mar   Apr
0  150  200  140.0   NaN
1  200  210  215.0   NaN
2   50   90    NaN  95.0

## Converting data types

In [104]:
df.dtypes

account     object
Jan          int64
Feb          int64
Mar        float64
Apr        float64
dtype: object

In [105]:
df['account'] = df['account'].astype('string')

In [106]:
df.dtypes

account     string
Jan          int64
Feb          int64
Mar        float64
Apr        float64
dtype: object

In [107]:
df[['Jan','Feb']] = df[['Jan','Feb']].astype('int16')

In [108]:
df.dtypes

account     string
Jan          int16
Feb          int16
Mar        float64
Apr        float64
dtype: object

In [110]:
df['account'] = df['account'].astype('category')

In [111]:
df['account']

0    Jones LLC
1     Alpha Co
2     Blue Inc
Name: account, dtype: category
Categories (3, string): [Alpha Co, Blue Inc, Jones LLC]

In [167]:
df['dd'] = pd.to_datetime(df['dd'], format='%d-%m-%Y')

In [171]:
df

     account  Jan  Feb    Mar         dd   Apr
0  Jones LLC  150  200  140.0 2023-02-07   NaN
1   Alpha Co  200  210  215.0 2023-02-08   NaN
2   Blue Inc   50   90    NaN 2023-02-09  95.0

In [172]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   account  3 non-null      object
 1   Jan      3 non-null      int64
 2   Feb      3 non-null      int64
 3   Mar      2 non-null      float64
 4   dd       3 non-null      datetime64[ns]
 5   Apr      1 non-null      float64
dtypes: datetime64[ns](1), float64(2), int64(2), object(1)
memory usage: 272.0+ bytes

## Missing values

In [112]:
df.dropna(subset=['Mar'])

     account  Jan  Feb    Mar  Apr
0  Jones LLC  150  200  140.0  NaN
1   Alpha Co  200  210  215.0  NaN

In [113]:
df[['Jan','Feb','Mar','Apr']].fillna(-1).astype('int16')

   Jan  Feb  Mar  Apr
0  150  200  140   -1
1  200  210  215   -1
2   50   90   -1   95

In [114]:
numeric_columns = df.select_dtypes(include='number').columns

df[numeric_columns] = df[numeric_columns].fillna(0).astype('int16')

In [207]:
df

     account  Jan  Feb    Mar         dd   Apr
0  Jones LLC  150  200  140.0 2023-02-07   NaN
1   Alpha Co  200  210  215.0 2023-02-08   NaN
2   Blue Inc   50   90    NaN 2023-02-09  95.0

                      Jan  Feb    Mar   Apr
account   dd
Jones LLC 2023-02-07  150  200  140.0   NaN
Alpha Co  2023-02-08  200  210  215.0   NaN
Blue Inc  2023-02-09   50   90    NaN  95.0

## Indexing and slicing

In [211]:
df['account']

0    Jones LLC
1     Alpha Co
2     Blue Inc
Name: account, dtype: object

In [213]:
df[['account','dd']]

     account         dd
0  Jones LLC 2023-02-07
1   Alpha Co 2023-02-08
2   Blue Inc 2023-02-09

In [216]:
df[df['Jan'] > 100]

     account  Jan  Feb    Mar         dd  Apr
0  Jones LLC  150  200  140.0 2023-02-07  NaN
1   Alpha Co  200  210  215.0 2023-02-08  NaN

In [217]:
df.loc[df['Jan'] > 100, ['account','dd']]

     account         dd
0  Jones LLC 2023-02-07
1   Alpha Co 2023-02-08

In [218]:
df.loc[df['Jan'] > 100, :]

     account  Jan  Feb    Mar         dd  Apr
0  Jones LLC  150  200  140.0 2023-02-07  NaN
1   Alpha Co  200  210  215.0 2023-02-08  NaN

In [219]:
df.loc[:, ['account','dd']]

     account         dd
0  Jones LLC 2023-02-07
1   Alpha Co 2023-02-08
2   Blue Inc 2023-02-09

In [220]:
df.loc[df['Jan'] > 100, 'Jan':'Mar']

   Jan  Feb    Mar
0  150  200  140.0
1  200  210  215.0